report/reports.org
#+AUTHOR: Angelo Basile
#+EMAIL: a.basile@student.rug.nl
#+DATE: [2016-11-19 sab]
#+OPTIONS: toc:nil

#+LaTeX_CLASS_OPTIONS: [article,11pt,nofixltx2e]
#+LATEX_HEADER: \usepackage{acl2016}
#+LATEX_HEADER: \usepackage{times}
#+LATEX_HEADER: \usepackage{url}
#+LATEX_HEADER: \usepackage{latexsym}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage[authoryear]{natbib}
#+LATEX_HEADER: \aclfinalcopy 

* TEMPLATE
  :PROPERTIES:
  :EXPORT_FILE_NAME: report-template-angelo
  :END:

#+BEGIN_ABSTRACT
For the weekly reports you might not need this, but it’s good to get used soon to writ- ing proper abstracts to research papers.  Give it a try, and we will provide feedback.
#+END_ABSTRACT

** Introduction

The template is structured along the lines of a re- search paper, and you can fill each appropriate sec- tion with the relevant information. The idea is that you get used to using the standard format adopted in research to report on experiments. At times this might feel a little stretched in the context of home- work and the exercises you are asked to complete, but give it a try. Also, don’t get too hung up about what should go where: try make decisions, and we will give you feedback. Finally, for spefific assignments you might want to implement some modifications to the template (for example in case you don’t have a separate test set, or you might want to have a more general “Experiments” sec- tion in case you have to run more than one, and stuff like that). Feel free to do so, as long as you maintain some proper structure which is appropri- ate for a research paper. Additional questions can be answered in the final section.
** Related work

For the reports you probably don’t need this, but in case you want to mention some background or motivate some choices that you made based on the existing literature, this is the place to do it.

** Data
Here you will report on what data you used. How much is it? Where did it come from? Is it annotated? Do you know anything about inter- annotator agreement?
** Method/Approach
Here you will report on method you chose to run your experiments. Also evaluation methods can go here. Any settings you used also can be described here. Do you have a separate dev set? Do you use cross-validation? What features are you using?
** Results
Your final results on test data. You can also include here some results on development, of course, but you should keep them clearly separate from results on test data. Results on development are useful to tune your system, so they better go in Method.  But for comparison you might want to report your best dev results also in this section. It can happen that for some assignments you have no separate test set, so this section in case can be merged with the previous one.
** Discussion/Conclusion
What observations can you glean from the results?  In the context of the course, you can really use this space not only to discuss the actual results with your own observations, but also to add some re- flections on what you had to do, strategies you adopted, what you could do differently, and so on.

** Answers to additional questions
If something doesn’t fit in the above, or if there are additional, more general questions in the assign- ment that are not directly answered in the previous sections, you can use this space for them.
* Personality prediction from tweets: a language independent approach ~ DRAFT
  :PROPERTIES:
  :EXPORT_FILE_NAME: s3275655-ltp-draft
  :EXPORT_AUTHOR: Angelo Basile - s3275655
  :END:

#+BEGIN_ABSTRACT
Author profiling is the task of predicting some aspects (e.g., gender, age, personality) of the author of a given text. In this paper we describe a system that predicts the personality of twitter users. We trained a neural network on the TwiSty corpus and we reached a [TODO ADD] x.xx in RMSE score.
#+END_ABSTRACT

** Introduction

It has been shown that given a text, it is possible to say a lot about its author: its gender, wheter he or she is old or young, if he is depressed, what is his dominant personality trait. This study focuses on this exact last thing: given some text --- tweets, in this case --- we want to predict the personality of the author.[TODO expand]

** Related Work

The work of [TODOLIU] shows that neural models can successfully model author personality traits from text. The authors suggest at the end of the paper that "the lack of feature engineering should support language independence". For this work we attempted to replicate the exact same model that [TODO fix][liu et al] built: we wanted to test wether it was possible to use it across languages.

For the baseline: we considered the submissions to the PAN forum [TODO ADD references and footnote explaining what PAN is] in the last years and we saw that many participants proposed an SVM-based model with a sparse feature representation. Such systems achieved good performances: we decided to use them as a baseline.

** Model

Our system consists of a recurrent and compositional neural network. A first layer builds embeddings at the character level; the output is then used to build word embeddings; finally, a feed forward network uses both these representations to predict each personality trait individually.

** Experiments
*** Data

For this task we trained and tested our model on the TwiSty corpus [TODO add reference]. Additionally, we worked on the PAN 2015 dataset in order to compare our results with those reported by [TODOLIU]: Table [[tab:sampledataset]] shows a sample of the data.

#+CAPTION: Sample instances from the PAN 2015 dataset
#+NAME: tab:sampledataset
#+ATTR_LaTeX: :float multicolumn
| author   | text                                              | ext |  sta | agr | con | opn |
|----------+---------------------------------------------------+-----+------+-----+-----+-----|
| e5b59ccc | @username @username ay friend, q te fumasteSSS... | 0.0 |  0.2 | 0.2 | 0.3 | 0.2 |
| ed970294 | “@username: @username "you can't have your cak... | 0.1 |  0.2 | 0.2 | 0.0 | 0.1 |
| 4b05f4e0 | I should probably go to bed considering I have... | 0.5 |  0.0 | 0.3 | 0.3 | 0.4 |
| de7f0515 | @username the sameee\n@username Great!!\nRT @u... | 0.2 | -0.1 | 0.2 | 0.0 | 0.1 |
| a71c93ed | On my very last Nerve!\nI am nothing and I hav... | 0.2 |  0.0 | 0.0 | 0.3 | 0.4 |

*** Pre-processing

For the baseline system we used the default pre-processor included in the scikit-learn tf-idf vectorizer, which lowercases all the words and .tokenizes the text.

*** Evaluation

** Results
*** Baseline

#+CAPTION: Results (negative MSE and standard deviation, CV-10) for the baseline system on the PAN 2015 dataset using the SVM classifier and unigrams with tf-idf normalization.
#+NAME: tab:baseline-pan2015
#+ATTR_LaTeX: :float multicolumn
|    | agr          | con          | ext          | opn          | sta          |
|----+--------------+--------------+--------------+--------------+--------------|
| en | -0.02 (0.02) | -0.02 (0.02) | -0.02 (0.02) | -0.02 (0.01) | -0.04 (0.04) |
|    |              |              |              |              |              |
|----+--------------+--------------+--------------+--------------+--------------|
| es | -0.02 (0.02) | -0.02 (0.03) | -0.02 (0.03) | -0.02 (0.03) | -0.03 (0.03) |
|----+--------------+--------------+--------------+--------------+--------------|
| it | -0.02 (0.04) | -0.01 (0.01) | -0.02 (0.05) | -0.02 (0.03) | -0.03 (0.04) |
|----+--------------+--------------+--------------+--------------+--------------|
| nl | -0.03 (0.04) | -0.01 (0.03) | -0.02 (0.03) | -0.01 (0.02) | -0.03 (0.06) |


